HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxEray_regdef.h
/** \\brief  New Data Register 4 */
typedef struct _Ifx_ERAY_NDAT4_Bits
{
    unsigned int ND96:1;                    /**< \brief [0:0] New Data 96 (96 = 96-127) (rh) */
    unsigned int ND97:1;                    /**< \brief [1:1] New Data 97 (97 = 96-127) (rh) */
    unsigned int ND98:1;                    /**< \brief [2:2] New Data 98 (98 = 96-127) (rh) */
    unsigned int ND99:1;                    /**< \brief [3:3] New Data 99 (99 = 96-127) (rh) */
    unsigned int ND100:1;                   /**< \brief [4:4] New Data 100 (100 = 96-127) (rh) */
    unsigned int ND101:1;                   /**< \brief [5:5] New Data 101 (101 = 96-127) (rh) */
    unsigned int ND102:1;                   /**< \brief [6:6] New Data 102 (102 = 96-127) (rh) */
    unsigned int ND103:1;                   /**< \brief [7:7] New Data 103 (103 = 96-127) (rh) */
    unsigned int ND104:1;                   /**< \brief [8:8] New Data 104 (104 = 96-127) (rh) */
    unsigned int ND105:1;                   /**< \brief [9:9] New Data 105 (105 = 96-127) (rh) */
    unsigned int ND106:1;                   /**< \brief [10:10] New Data 106 (106 = 96-127) (rh) */
    unsigned int ND107:1;                   /**< \brief [11:11] New Data 107 (107 = 96-127) (rh) */
    unsigned int ND108:1;                   /**< \brief [12:12] New Data 108 (108 = 96-127) (rh) */
    unsigned int ND109:1;                   /**< \brief [13:13] New Data 109 (109 = 96-127) (rh) */
    unsigned int ND110:1;                   /**< \brief [14:14] New Data 110 (110 = 96-127) (rh) */
    unsigned int ND111:1;                   /**< \brief [15:15] New Data 111 (111 = 96-127) (rh) */
    unsigned int ND112:1;                   /**< \brief [16:16] New Data 112 (112 = 96-127) (rh) */
    unsigned int ND113:1;                   /**< \brief [17:17] New Data 113 (113 = 96-127) (rh) */
    unsigned int ND114:1;                   /**< \brief [18:18] New Data 114 (114 = 96-127) (rh) */
    unsigned int ND115:1;                   /**< \brief [19:19] New Data 115 (115 = 96-127) (rh) */
    unsigned int ND116:1;                   /**< \brief [20:20] New Data 116 (116 = 96-127) (rh) */
    unsigned int ND117:1;                   /**< \brief [21:21] New Data 117 (117 = 96-127) (rh) */
    unsigned int ND118:1;                   /**< \brief [22:22] New Data 118 (118 = 96-127) (rh) */
    unsigned int ND119:1;                   /**< \brief [23:23] New Data 119 (119 = 96-127) (rh) */
    unsigned int ND120:1;                   /**< \brief [24:24] New Data 120 (120 = 96-127) (rh) */
    unsigned int ND121:1;                   /**< \brief [25:25] New Data 121 (121 = 96-127) (rh) */
    unsigned int ND122:1;                   /**< \brief [26:26] New Data 122 (122 = 96-127) (rh) */
    unsigned int ND123:1;                   /**< \brief [27:27] New Data 123 (123 = 96-127) (rh) */
    unsigned int ND124:1;                   /**< \brief [28:28] New Data 124 (124 = 96-127) (rh) */
    unsigned int ND125:1;                   /**< \brief [29:29] New Data 125 (125 = 96-127) (rh) */
    unsigned int ND126:1;                   /**< \brief [30:30] New Data 126 (126 = 96-127) (rh) */
    unsigned int ND127:1;                   /**< \brief [31:31] New Data 127 (127 = 96-127) (rh) */
} Ifx_ERAY_NDAT4_Bits;

/** \\brief  New Data Interrupt Control 1 */
typedef struct _Ifx_ERAY_NDIC1_Bits
{
    unsigned int NDIP0:1;                   /**< \brief [0:0] New Data Interrupt Pointer 0 (0 = 0-31) (rw) */
    unsigned int NDIP1:1;                   /**< \brief [1:1] New Data Interrupt Pointer 1 (1 = 0-31) (rw) */
    unsigned int NDIP2:1;                   /**< \brief [2:2] New Data Interrupt Pointer 2 (2 = 0-31) (rw) */
    unsigned int NDIP3:1;                   /**< \brief [3:3] New Data Interrupt Pointer 3 (3 = 0-31) (rw) */
    unsigned int NDIP4:1;                   /**< \brief [4:4] New Data Interrupt Pointer 4 (4 = 0-31) (rw) */
    unsigned int NDIP5:1;                   /**< \brief [5:5] New Data Interrupt Pointer 5 (5 = 0-31) (rw) */
    unsigned int NDIP6:1;                   /**< \brief [6:6] New Data Interrupt Pointer 6 (6 = 0-31) (rw) */
    unsigned int NDIP7:1;                   /**< \brief [7:7] New Data Interrupt Pointer 7 (7 = 0-31) (rw) */
    unsigned int NDIP8:1;                   /**< \brief [8:8] New Data Interrupt Pointer 8 (8 = 0-31) (rw) */
    unsigned int NDIP9:1;                   /**< \brief [9:9] New Data Interrupt Pointer 9 (9 = 0-31) (rw) */
    unsigned int NDIP10:1;                  /**< \brief [10:10] New Data Interrupt Pointer 10 (10 = 0-31) (rw) */
    unsigned int NDIP11:1;                  /**< \brief [11:11] New Data Interrupt Pointer 11 (11 = 0-31) (rw) */
    unsigned int NDIP12:1;                  /**< \brief [12:12] New Data Interrupt Pointer 12 (12 = 0-31) (rw) */
    unsigned int NDIP13:1;                  /**< \brief [13:13] New Data Interrupt Pointer 13 (13 = 0-31) (rw) */
    unsigned int NDIP14:1;                  /**< \brief [14:14] New Data Interrupt Pointer 14 (14 = 0-31) (rw) */
    unsigned int NDIP15:1;                  /**< \brief [15:15] New Data Interrupt Pointer 15 (15 = 0-31) (rw) */
    unsigned int NDIP16:1;                  /**< \brief [16:16] New Data Interrupt Pointer 16 (16 = 0-31) (rw) */
    unsigned int NDIP17:1;                  /**< \brief [17:17] New Data Interrupt Pointer 17 (17 = 0-31) (rw) */
    unsigned int NDIP18:1;                  /**< \brief [18:18] New Data Interrupt Pointer 18 (18 = 0-31) (rw) */
    unsigned int NDIP19:1;                  /**< \brief [19:19] New Data Interrupt Pointer 19 (19 = 0-31) (rw) */
    unsigned int NDIP20:1;                  /**< \brief [20:20] New Data Interrupt Pointer 20 (20 = 0-31) (rw) */
    unsigned int NDIP21:1;                  /**< \brief [21:21] New Data Interrupt Pointer 21 (21 = 0-31) (rw) */
    unsigned int NDIP22:1;                  /**< \brief [22:22] New Data Interrupt Pointer 22 (22 = 0-31) (rw) */
    unsigned int NDIP23:1;                  /**< \brief [23:23] New Data Interrupt Pointer 23 (23 = 0-31) (rw) */
    unsigned int NDIP24:1;                  /**< \brief [24:24] New Data Interrupt Pointer 24 (24 = 0-31) (rw) */
    unsigned int NDIP25:1;                  /**< \brief [25:25] New Data Interrupt Pointer 25 (25 = 0-31) (rw) */
    unsigned int NDIP26:1;                  /**< \brief [26:26] New Data Interrupt Pointer 26 (26 = 0-31) (rw) */
    unsigned int NDIP27:1;                  /**< \brief [27:27] New Data Interrupt Pointer 27 (27 = 0-31) (rw) */
    unsigned int NDIP28:1;                  /**< \brief [28:28] New Data Interrupt Pointer 28 (28 = 0-31) (rw) */
    unsigned int NDIP29:1;                  /**< \brief [29:29] New Data Interrupt Pointer 29 (29 = 0-31) (rw) */
    unsigned int NDIP30:1;                  /**< \brief [30:30] New Data Interrupt Pointer 30 (30 = 0-31) (rw) */
    unsigned int NDIP31:1;                  /**< \brief [31:31] New Data Interrupt Pointer 31 (31 = 0-31) (rw) */
} Ifx_ERAY_NDIC1_Bits;

/** \\brief  New Data Interrupt Control 2 */
typedef struct _Ifx_ERAY_NDIC2_Bits
{
    unsigned int NDIP32:1;                  /**< \brief [0:0] New Data Interrupt Pointer 32 (32 = 32-63) (rw) */
    unsigned int NDIP33:1;                  /**< \brief [1:1] New Data Interrupt Pointer 33 (33 = 32-63) (rw) */
    unsigned int NDIP34:1;                  /**< \brief [2:2] New Data Interrupt Pointer 34 (34 = 32-63) (rw) */
    unsigned int NDIP35:1;                  /**< \brief [3:3] New Data Interrupt Pointer 35 (35 = 32-63) (rw) */
    unsigned int NDIP36:1;                  /**< \brief [4:4] New Data Interrupt Pointer 36 (36 = 32-63) (rw) */
    unsigned int NDIP37:1;                  /**< \brief [5:5] New Data Interrupt Pointer 37 (37 = 32-63) (rw) */
    unsigned int NDIP38:1;                  /**< \brief [6:6] New Data Interrupt Pointer 38 (38 = 32-63) (rw) */
    unsigned int NDIP39:1;                  /**< \brief [7:7] New Data Interrupt Pointer 39 (39 = 32-63) (rw) */
    unsigned int NDIP40:1;                  /**< \brief [8:8] New Data Interrupt Pointer 40 (40 = 32-63) (rw) */
    unsigned int NDIP41:1;                  /**< \brief [9:9] New Data Interrupt Pointer 41 (41 = 32-63) (rw) */
    unsigned int NDIP42:1;                  /**< \brief [10:10] New Data Interrupt Pointer 42 (42 = 32-63) (rw) */
    unsigned int NDIP43:1;                  /**< \brief [11:11] New Data Interrupt Pointer 43 (43 = 32-63) (rw) */
    unsigned int NDIP44:1;                  /**< \brief [12:12] New Data Interrupt Pointer 44 (44 = 32-63) (rw) */
    unsigned int NDIP45:1;                  /**< \brief [13:13] New Data Interrupt Pointer 45 (45 = 32-63) (rw) */
    unsigned int NDIP46:1;                  /**< \brief [14:14] New Data Interrupt Pointer 46 (46 = 32-63) (rw) */
    unsigned int NDIP47:1;                  /**< \brief [15:15] New Data Interrupt Pointer 47 (47 = 32-63) (rw) */
    unsigned int NDIP48:1;                  /**< \brief [16:16] New Data Interrupt Pointer 48 (48 = 32-63) (rw) */
    unsigned int NDIP49:1;                  /**< \brief [17:17] New Data Interrupt Pointer 49 (49 = 32-63) (rw) */
    unsigned int NDIP50:1;                  /**< \brief [18:18] New Data Interrupt Pointer 50 (50 = 32-63) (rw) */
    unsigned int NDIP51:1;                  /**< \brief [19:19] New Data Interrupt Pointer 51 (51 = 32-63) (rw) */
    unsigned int NDIP52:1;                  /**< \brief [20:20] New Data Interrupt Pointer 52 (52 = 32-63) (rw) */
    unsigned int NDIP53:1;                  /**< \brief [21:21] New Data Interrupt Pointer 53 (53 = 32-63) (rw) */
    unsigned int NDIP54:1;                  /**< \brief [22:22] New Data Interrupt Pointer 54 (54 = 32-63) (rw) */
    unsigned int NDIP55:1;                  /**< \brief [23:23] New Data Interrupt Pointer 55 (55 = 32-63) (rw) */
    unsigned int NDIP56:1;                  /**< \brief [24:24] New Data Interrupt Pointer 56 (56 = 32-63) (rw) */
    unsigned int NDIP57:1;                  /**< \brief [25:25] New Data Interrupt Pointer 57 (57 = 32-63) (rw) */
    unsigned int NDIP58:1;                  /**< \brief [26:26] New Data Interrupt Pointer 58 (58 = 32-63) (rw) */
    unsigned int NDIP59:1;                  /**< \brief [27:27] New Data Interrupt Pointer 59 (59 = 32-63) (rw) */
    unsigned int NDIP60:1;                  /**< \brief [28:28] New Data Interrupt Pointer 60 (60 = 32-63) (rw) */
    unsigned int NDIP61:1;                  /**< \brief [29:29] New Data Interrupt Pointer 61 (61 = 32-63) (rw) */
    unsigned int NDIP62:1;                  /**< \brief [30:30] New Data Interrupt Pointer 62 (62 = 32-63) (rw) */
    unsigned int NDIP63:1;                  /**< \brief [31:31] New Data Interrupt Pointer 63 (63 = 32-63) (rw) */
} Ifx_ERAY_NDIC2_Bits;

/** \\brief  New Data Interrupt Control 3 */
typedef struct _Ifx_ERAY_NDIC3_Bits
{
    unsigned int NDIP64:1;                  /**< \brief [0:0] New Data Interrupt Pointer 64 (64 = 64-95) (rw) */
    unsigned int NDIP65:1;                  /**< \brief [1:1] New Data Interrupt Pointer 65 (65 = 64-95) (rw) */
    unsigned int NDIP66:1;                  /**< \brief [2:2] New Data Interrupt Pointer 66 (66 = 64-95) (rw) */
    unsigned int NDIP67:1;                  /**< \brief [3:3] New Data Interrupt Pointer 67 (67 = 64-95) (rw) */
    unsigned int NDIP68:1;                  /**< \brief [4:4] New Data Interrupt Pointer 68 (68 = 64-95) (rw) */
    unsigned int NDIP69:1;                  /**< \brief [5:5] New Data Interrupt Pointer 69 (69 = 64-95) (rw) */
    unsigned int NDIP70:1;                  /**< \brief [6:6] New Data Interrupt Pointer 70 (70 = 64-95) (rw) */
    unsigned int NDIP71:1;                  /**< \brief [7:7] New Data Interrupt Pointer 71 (71 = 64-95) (rw) */
    unsigned int NDIP72:1;                  /**< \brief [8:8] New Data Interrupt Pointer 72 (72 = 64-95) (rw) */
    unsigned int NDIP73:1;                  /**< \brief [9:9] New Data Interrupt Pointer 73 (73 = 64-95) (rw) */
    unsigned int NDIP74:1;                  /**< \brief [10:10] New Data Interrupt Pointer 74 (74 = 64-95) (rw) */
    unsigned int NDIP75:1;                  /**< \brief [11:11] New Data Interrupt Pointer 75 (75 = 64-95) (rw) */
    unsigned int NDIP76:1;                  /**< \brief [12:12] New Data Interrupt Pointer 76 (76 = 64-95) (rw) */
    unsigned int NDIP77:1;                  /**< \brief [13:13] New Data Interrupt Pointer 77 (77 = 64-95) (rw) */
    unsigned int NDIP78:1;                  /**< \brief [14:14] New Data Interrupt Pointer 78 (78 = 64-95) (rw) */
    unsigned int NDIP79:1;                  /**< \brief [15:15] New Data Interrupt Pointer 79 (79 = 64-95) (rw) */
    unsigned int NDIP80:1;                  /**< \brief [16:16] New Data Interrupt Pointer 80 (80 = 64-95) (rw) */
    unsigned int NDIP81:1;                  /**< \brief [17:17] New Data Interrupt Pointer 81 (81 = 64-95) (rw) */
    unsigned int NDIP82:1;                  /**< \brief [18:18] New Data Interrupt Pointer 82 (82 = 64-95) (rw) */
    unsigned int NDIP83:1;                  /**< \brief [19:19] New Data Interrupt Pointer 83 (83 = 64-95) (rw) */
    unsigned int NDIP84:1;                  /**< \brief [20:20] New Data Interrupt Pointer 84 (84 = 64-95) (rw) */
    unsigned int NDIP85:1;                  /**< \brief [21:21] New Data Interrupt Pointer 85 (85 = 64-95) (rw) */
    unsigned int NDIP86:1;                  /**< \brief [22:22] New Data Interrupt Pointer 86 (86 = 64-95) (rw) */
    unsigned int NDIP87:1;                  /**< \brief [23:23] New Data Interrupt Pointer 87 (87 = 64-95) (rw) */
    unsigned int NDIP88:1;                  /**< \brief [24:24] New Data Interrupt Pointer 88 (88 = 64-95) (rw) */
    unsigned int NDIP89:1;                  /**< \brief [25:25] New Data Interrupt Pointer 89 (89 = 64-95) (rw) */
    unsigned int NDIP90:1;                  /**< \brief [26:26] New Data Interrupt Pointer 90 (90 = 64-95) (rw) */
    unsigned int NDIP91:1;                  /**< \brief [27:27] New Data Interrupt Pointer 91 (91 = 64-95) (rw) */
    unsigned int NDIP92:1;                  /**< \brief [28:28] New Data Interrupt Pointer 92 (92 = 64-95) (rw) */
    unsigned int NDIP93:1;                  /**< \brief [29:29] New Data Interrupt Pointer 93 (93 = 64-95) (rw) */
    unsigned int NDIP94:1;                  /**< \brief [30:30] New Data Interrupt Pointer 94 (94 = 64-95) (rw) */
    unsigned int NDIP95:1;                  /**< \brief [31:31] New Data Interrupt Pointer 95 (95 = 64-95) (rw) */
} Ifx_ERAY_NDIC3_Bits;

/** \\brief  New Data Interrupt Control 4 */
typedef struct _Ifx_ERAY_NDIC4_Bits
{
    unsigned int NDIP96:1;                  /**< \brief [0:0] New Data Interrupt Pointer 96 (96 = 96-127) (rw) */
    unsigned int NDIP97:1;                  /**< \brief [1:1] New Data Interrupt Pointer 97 (97 = 96-127) (rw) */
    unsigned int NDIP98:1;                  /**< \brief [2:2] New Data Interrupt Pointer 98 (98 = 96-127) (rw) */
    unsigned int NDIP99:1;                  /**< \brief [3:3] New Data Interrupt Pointer 99 (99 = 96-127) (rw) */
    unsigned int NDIP100:1;                 /**< \brief [4:4] New Data Interrupt Pointer 100 (100 = 96-127) (rw) */
    unsigned int NDIP101:1;                 /**< \brief [5:5] New Data Interrupt Pointer 101 (101 = 96-127) (rw) */
    unsigned int NDIP102:1;                 /**< \brief [6:6] New Data Interrupt Pointer 102 (102 = 96-127) (rw) */
    unsigned int NDIP103:1;                 /**< \brief [7:7] New Data Interrupt Pointer 103 (103 = 96-127) (rw) */
    unsigned int NDIP104:1;                 /**< \brief [8:8] New Data Interrupt Pointer 104 (104 = 96-127) (rw) */
    unsigned int NDIP105:1;                 /**< \brief [9:9] New Data Interrupt Pointer 105 (105 = 96-127) (rw) */
    unsigned int NDIP106:1;                 /**< \brief [10:10] New Data Interrupt Pointer 106 (106 = 96-127) (rw) */
    unsigned int NDIP107:1;                 /**< \brief [11:11] New Data Interrupt Pointer 107 (107 = 96-127) (rw) */
    unsigned int NDIP108:1;                 /**< \brief [12:12] New Data Interrupt Pointer 108 (108 = 96-127) (rw) */
    unsigned int NDIP109:1;                 /**< \brief [13:13] New Data Interrupt Pointer 109 (109 = 96-127) (rw) */
    unsigned int NDIP110:1;                 /**< \brief [14:14] New Data Interrupt Pointer 110 (110 = 96-127) (rw) */
    unsigned int NDIP111:1;                 /**< \brief [15:15] New Data Interrupt Pointer 111 (111 = 96-127) (rw) */
    unsigned int NDIP112:1;                 /**< \brief [16:16] New Data Interrupt Pointer 112 (112 = 96-127) (rw) */
    unsigned int NDIP113:1;                 /**< \brief [17:17] New Data Interrupt Pointer 113 (113 = 96-127) (rw) */
    unsigned int NDIP114:1;                 /**< \brief [18:18] New Data Interrupt Pointer 114 (114 = 96-127) (rw) */
    unsigned int NDIP115:1;                 /**< \brief [19:19] New Data Interrupt Pointer 115 (115 = 96-127) (rw) */
    unsigned int NDIP116:1;                 /**< \brief [20:20] New Data Interrupt Pointer 116 (116 = 96-127) (rw) */
    unsigned int NDIP117:1;                 /**< \brief [21:21] New Data Interrupt Pointer 117 (117 = 96-127) (rw) */
    unsigned int NDIP118:1;                 /**< \brief [22:22] New Data Interrupt Pointer 118 (118 = 96-127) (rw) */
    unsigned int NDIP119:1;                 /**< \brief [23:23] New Data Interrupt Pointer 119 (119 = 96-127) (rw) */
    unsigned int NDIP120:1;                 /**< \brief [24:24] New Data Interrupt Pointer 120 (120 = 96-127) (rw) */
    unsigned int NDIP121:1;                 /**< \brief [25:25] New Data Interrupt Pointer 121 (121 = 96-127) (rw) */
    unsigned int NDIP122:1;                 /**< \brief [26:26] New Data Interrupt Pointer 122 (122 = 96-127) (rw) */
    unsigned int NDIP123:1;                 /**< \brief [27:27] New Data Interrupt Pointer 123 (123 = 96-127) (rw) */
    unsigned int NDIP124:1;                 /**< \brief [28:28] New Data Interrupt Pointer 124 (124 = 96-127) (rw) */
    unsigned int NDIP125:1;                 /**< \brief [29:29] New Data Interrupt Pointer 125 (125 = 96-127) (rw) */
    unsigned int NDIP126:1;                 /**< \brief [30:30] New Data Interrupt Pointer 126 (126 = 96-127) (rw) */
    unsigned int NDIP127:1;                 /**< \brief [31:31] New Data Interrupt Pointer 127 (127 = 96-127) (rw) */
} Ifx_ERAY_NDIC4_Bits;

/** \\brief  NEM Configuration Register */
typedef struct _Ifx_ERAY_NEMC_Bits
{
    unsigned int NML:4;                     /**< \brief [3:0] Network Management Vector Length (gNetworkManagementVectorLength) (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_ERAY_NEMC_Bits;

/** \\brief  Network Management Vector */
typedef struct _Ifx_ERAY_NMV_Bits
{
    unsigned int NM:32;                     /**< \brief [31:0] Network Management Vector (rh) */
} Ifx_ERAY_NMV_Bits;

/** \\brief  Output Buffer Command Mask */
typedef struct _Ifx_ERAY_OBCM_Bits
{
    unsigned int RHSS:1;                    /**< \brief [0:0] Read Header Section Shadow (rwh) */
    unsigned int RDSS:1;                    /**< \brief [1:1] Read Data Section Shadow (rwh) */
    unsigned int reserved_2:14;             /**< \brief \internal Reserved */
    unsigned int RHSH:1;                    /**< \brief [16:16] Read Header Section Host (rh) */
    unsigned int RDSH:1;                    /**< \brief [17:17] Read Data Section Host (rh) */
    unsigned int reserved_18:14;            /**< \brief \internal Reserved */
} Ifx_ERAY_OBCM_Bits;

/** \\brief  Output Buffer Command Request */
typedef struct _Ifx_ERAY_OBCR_Bits
{
    unsigned int OBRS:7;                    /**< \brief [6:0] Output Buffer Request Shadow (rw) */
    unsigned int reserved_7:1;              /**< \brief \internal Reserved */
    unsigned int VIEW:1;                    /**< \brief [8:8] View Shadow Buffer (rw) */
    unsigned int REQ:1;                     /**< \brief [9:9] Request Message RAM Transfer (rw) */
    unsigned int reserved_10:5;             /**< \brief \internal Reserved */
    unsigned int OBSYS:1;                   /**< \brief [15:15] Output Buffer Busy Shadow (rh) */
    unsigned int OBRH:7;                    /**< \brief [22:16] Output Buffer Request Host (rh) */
    unsigned int reserved_23:9;             /**< \brief \internal Reserved */
} Ifx_ERAY_OBCR_Bits;

