HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxEray_regdef.h
/** \\brief  OCDS Control and Status */
typedef struct _Ifx_ERAY_OCS_Bits
{
    unsigned int reserved_0:24;             /**< \brief \internal Reserved */
    unsigned int SUS:4;                     /**< \brief [27:24] OCDS Suspend Control (rw) */
    unsigned int SUS_P:1;                   /**< \brief [28:28] SUS Write Protection (w) */
    unsigned int SUSSTA:1;                  /**< \brief [29:29] Suspend State (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ERAY_OCS_Bits;

/** \\brief  Offset Correction Value */
typedef struct _Ifx_ERAY_OCV_Bits
{
    unsigned int OCV:19;                    /**< \brief [18:0] Offset Correction Value (vOffsetCorrection) (rh) */
    unsigned int reserved_19:13;            /**< \brief \internal Reserved */
} Ifx_ERAY_OCV_Bits;

/** \\brief  Odd Sync ID Symbol Window */
typedef struct _Ifx_ERAY_OSID_Bits
{
    unsigned int OID:10;                    /**< \brief [9:0] Odd Sync ID (vsSyncIDListA,B odd) (rh) */
    unsigned int reserved_10:4;             /**< \brief \internal Reserved */
    unsigned int RXOA:1;                    /**< \brief [14:14] Received Odd Sync ID on Channel A (rh) */
    unsigned int RXOB:1;                    /**< \brief [15:15] Received Odd Sync ID on Channel B (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_ERAY_OSID_Bits;

/** \\brief  OCDS Trigger Set Select */
typedef struct _Ifx_ERAY_OTSS_Bits
{
    unsigned int OTGB0:2;                   /**< \brief [1:0] Trigger Set for OTGB0 (rw) */
    unsigned int reserved_2:6;              /**< \brief \internal Reserved */
    unsigned int OTGB1:2;                   /**< \brief [9:8] Trigger Set for OTGB1 (rw) */
    unsigned int reserved_10:6;             /**< \brief \internal Reserved */
    unsigned int OTGB2:1;                   /**< \brief [16:16] Trigger Set for OTGB2 (rw) */
    unsigned int reserved_17:15;            /**< \brief \internal Reserved */
} Ifx_ERAY_OTSS_Bits;

/** \\brief  PRT Configuration Register 1 */
typedef struct _Ifx_ERAY_PRTC1_Bits
{
    unsigned int TSST:4;                    /**< \brief [3:0] Transmission Start Sequence Transmitter (gdTSSTransmitter) (rw) */
    unsigned int CASM:7;                    /**< \brief [10:4] Collision Avoidance Symbol Maximum(gdCASRxLowMax) (rw) */
    unsigned int reserved_11:1;             /**< \brief \internal Reserved */
    unsigned int SPP:2;                     /**< \brief [13:12] Strobe Point Position (rw) */
    unsigned int BRP:2;                     /**< \brief [15:14] Baud Rate Prescaler(gdSampleClockPeriod, pSamplePerMicrotick) (rw) */
    unsigned int RXW:9;                     /**< \brief [24:16] Wakeup Symbol Receive Window Length (gdWakeupSymbolRxWindow) (rw) */
    unsigned int reserved_25:1;             /**< \brief \internal Reserved */
    unsigned int RWP:6;                     /**< \brief [31:26] Repetitions of Tx Wakeup Pattern (pWakeupPattern) (rw) */
} Ifx_ERAY_PRTC1_Bits;

/** \\brief  PRT Configuration Register 2 */
typedef struct _Ifx_ERAY_PRTC2_Bits
{
    unsigned int RXI:6;                     /**< \brief [5:0] Wakeup Symbol Receive Idle (gdWakeupSymbolRxIdle) (rw) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int RXL:6;                     /**< \brief [13:8] Wakeup Symbol Receive Low(gdWakeupSymbolRxLow) (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int TXI:8;                     /**< \brief [23:16] Wakeup Symbol Transmit Idle (gdWakeupSymbolTxIdle) (rw) */
    unsigned int TXL:6;                     /**< \brief [29:24] Wakeup Symbol Transmit Low (gdWakeupSymbolTxLow) (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ERAY_PRTC2_Bits;

/** \\brief  Rate Correction Value */
typedef struct _Ifx_ERAY_RCV_Bits
{
    unsigned int RCV:12;                    /**< \brief [11:0] Rate Correction Value (vRateCorrection) (rh) */
    unsigned int reserved_12:20;            /**< \brief \internal Reserved */
} Ifx_ERAY_RCV_Bits;

/** \\brief  Read Data Section */
typedef struct _Ifx_ERAY_RDDS_Bits
{
    unsigned int MDRB0:8;                   /**< \brief [7:0] 32-Bit Word nn, Byte 0 (rh) */
    unsigned int MDRB1:8;                   /**< \brief [15:8] 32-Bit Word nn, Byte 1 (rh) */
    unsigned int MDRB2:8;                   /**< \brief [23:16] 32-Bit Word nn, Byte 2 (rh) */
    unsigned int MDRB3:8;                   /**< \brief [31:24] 32-Bit Word nn, Byte 3 (rh) */
} Ifx_ERAY_RDDS_Bits;

/** \\brief  Read Header Section 1 */
typedef struct _Ifx_ERAY_RDHS1_Bits
{
    unsigned int FID:11;                    /**< \brief [10:0] Frame ID (rh) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int CYC:7;                     /**< \brief [22:16] Cycle Code (rh) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int CHA:1;                     /**< \brief [24:24] Channel Filter Control A (rh) */
    unsigned int CHB:1;                     /**< \brief [25:25] Channel Filter Control B (rh) */
    unsigned int CFG:1;                     /**< \brief [26:26] Message Buffer Direction Configuration Bit (rh) */
    unsigned int PPIT:1;                    /**< \brief [27:27] Payload Preamble Indicator Transmit (rh) */
    unsigned int TXM:1;                     /**< \brief [28:28] Transmission Mode (rh) */
    unsigned int MBI:1;                     /**< \brief [29:29] Message Buffer Service Request (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ERAY_RDHS1_Bits;

/** \\brief  Read Header Section 2 */
typedef struct _Ifx_ERAY_RDHS2_Bits
{
    unsigned int CRC:11;                    /**< \brief [10:0] Header CRC (vRF!Header!HeaderCRC) (rh) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int PLC:7;                     /**< \brief [22:16] Payload Length Configured (rh) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int PLR:7;                     /**< \brief [30:24] Payload Length Received (vRF!Header!Length) (rh) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_ERAY_RDHS2_Bits;

/** \\brief  Read Header Section 3 */
typedef struct _Ifx_ERAY_RDHS3_Bits
{
    unsigned int DP:11;                     /**< \brief [10:0] Data Pointer (rh) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int RCC:6;                     /**< \brief [21:16] Receive Cycle Count (vRF!Header!CycleCount) (rh) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int RCI:1;                     /**< \brief [24:24] Received on Channel Indicator (vSS!Channel) (rh) */
    unsigned int SFI:1;                     /**< \brief [25:25] Startup Frame Indicator (vRF!Header!SuFIndicator) (rh) */
    unsigned int SYN:1;                     /**< \brief [26:26] SYNC Frame Indicator (vRF!Header!SyFIndicator) (rh) */
    unsigned int NFI:1;                     /**< \brief [27:27] NULL Frame Indicator (vRF!Header!NFIndicator) (rh) */
    unsigned int PPI:1;                     /**< \brief [28:28] Payload Preamble Indicator (vRF!Header!PPIndicator) (rh) */
    unsigned int RES:1;                     /**< \brief [29:29] Reserved Bit (vRF!Header!Reserved) (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ERAY_RDHS3_Bits;

