HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxEray_regdef.h
/** \\brief  Transmission Request Register 2 */
typedef struct _Ifx_ERAY_TXRQ2_Bits
{
    unsigned int TXR32:1;                   /**< \brief [0:0] Transmission Request 32 (32 = 32-63) (rh) */
    unsigned int TXR33:1;                   /**< \brief [1:1] Transmission Request 33 (33 = 32-63) (rh) */
    unsigned int TXR34:1;                   /**< \brief [2:2] Transmission Request 34 (34 = 32-63) (rh) */
    unsigned int TXR35:1;                   /**< \brief [3:3] Transmission Request 35 (35 = 32-63) (rh) */
    unsigned int TXR36:1;                   /**< \brief [4:4] Transmission Request 36 (36 = 32-63) (rh) */
    unsigned int TXR37:1;                   /**< \brief [5:5] Transmission Request 37 (37 = 32-63) (rh) */
    unsigned int TXR38:1;                   /**< \brief [6:6] Transmission Request 38 (38 = 32-63) (rh) */
    unsigned int TXR39:1;                   /**< \brief [7:7] Transmission Request 39 (39 = 32-63) (rh) */
    unsigned int TXR40:1;                   /**< \brief [8:8] Transmission Request 40 (40 = 32-63) (rh) */
    unsigned int TXR41:1;                   /**< \brief [9:9] Transmission Request 41 (41 = 32-63) (rh) */
    unsigned int TXR42:1;                   /**< \brief [10:10] Transmission Request 42 (42 = 32-63) (rh) */
    unsigned int TXR43:1;                   /**< \brief [11:11] Transmission Request 43 (43 = 32-63) (rh) */
    unsigned int TXR44:1;                   /**< \brief [12:12] Transmission Request 44 (44 = 32-63) (rh) */
    unsigned int TXR45:1;                   /**< \brief [13:13] Transmission Request 45 (45 = 32-63) (rh) */
    unsigned int TXR46:1;                   /**< \brief [14:14] Transmission Request 46 (46 = 32-63) (rh) */
    unsigned int TXR47:1;                   /**< \brief [15:15] Transmission Request 47 (47 = 32-63) (rh) */
    unsigned int TXR48:1;                   /**< \brief [16:16] Transmission Request 48 (48 = 32-63) (rh) */
    unsigned int TXR49:1;                   /**< \brief [17:17] Transmission Request 49 (49 = 32-63) (rh) */
    unsigned int TXR50:1;                   /**< \brief [18:18] Transmission Request 50 (50 = 32-63) (rh) */
    unsigned int TXR51:1;                   /**< \brief [19:19] Transmission Request 51 (51 = 32-63) (rh) */
    unsigned int TXR52:1;                   /**< \brief [20:20] Transmission Request 52 (52 = 32-63) (rh) */
    unsigned int TXR53:1;                   /**< \brief [21:21] Transmission Request 53 (53 = 32-63) (rh) */
    unsigned int TXR54:1;                   /**< \brief [22:22] Transmission Request 54 (54 = 32-63) (rh) */
    unsigned int TXR55:1;                   /**< \brief [23:23] Transmission Request 55 (55 = 32-63) (rh) */
    unsigned int TXR56:1;                   /**< \brief [24:24] Transmission Request 56 (56 = 32-63) (rh) */
    unsigned int TXR57:1;                   /**< \brief [25:25] Transmission Request 57 (57 = 32-63) (rh) */
    unsigned int TXR58:1;                   /**< \brief [26:26] Transmission Request 58 (58 = 32-63) (rh) */
    unsigned int TXR59:1;                   /**< \brief [27:27] Transmission Request 59 (59 = 32-63) (rh) */
    unsigned int TXR60:1;                   /**< \brief [28:28] Transmission Request 60 (60 = 32-63) (rh) */
    unsigned int TXR61:1;                   /**< \brief [29:29] Transmission Request 61 (61 = 32-63) (rh) */
    unsigned int TXR62:1;                   /**< \brief [30:30] Transmission Request 62 (62 = 32-63) (rh) */
    unsigned int TXR63:1;                   /**< \brief [31:31] Transmission Request 63 (63 = 32-63) (rh) */
} Ifx_ERAY_TXRQ2_Bits;

/** \\brief  Transmission Request Register 3 */
typedef struct _Ifx_ERAY_TXRQ3_Bits
{
    unsigned int TXR64:1;                   /**< \brief [0:0] Transmission Request 64 (64 = 64-95) (rh) */
    unsigned int TXR65:1;                   /**< \brief [1:1] Transmission Request 65 (65 = 64-95) (rh) */
    unsigned int TXR66:1;                   /**< \brief [2:2] Transmission Request 66 (66 = 64-95) (rh) */
    unsigned int TXR67:1;                   /**< \brief [3:3] Transmission Request 67 (67 = 64-95) (rh) */
    unsigned int TXR68:1;                   /**< \brief [4:4] Transmission Request 68 (68 = 64-95) (rh) */
    unsigned int TXR69:1;                   /**< \brief [5:5] Transmission Request 69 (69 = 64-95) (rh) */
    unsigned int TXR70:1;                   /**< \brief [6:6] Transmission Request 70 (70 = 64-95) (rh) */
    unsigned int TXR71:1;                   /**< \brief [7:7] Transmission Request 71 (71 = 64-95) (rh) */
    unsigned int TXR72:1;                   /**< \brief [8:8] Transmission Request 72 (72 = 64-95) (rh) */
    unsigned int TXR73:1;                   /**< \brief [9:9] Transmission Request 73 (73 = 64-95) (rh) */
    unsigned int TXR74:1;                   /**< \brief [10:10] Transmission Request 74 (74 = 64-95) (rh) */
    unsigned int TXR75:1;                   /**< \brief [11:11] Transmission Request 75 (75 = 64-95) (rh) */
    unsigned int TXR76:1;                   /**< \brief [12:12] Transmission Request 76 (76 = 64-95) (rh) */
    unsigned int TXR77:1;                   /**< \brief [13:13] Transmission Request 77 (77 = 64-95) (rh) */
    unsigned int TXR78:1;                   /**< \brief [14:14] Transmission Request 78 (78 = 64-95) (rh) */
    unsigned int TXR79:1;                   /**< \brief [15:15] Transmission Request 79 (79 = 64-95) (rh) */
    unsigned int TXR80:1;                   /**< \brief [16:16] Transmission Request 80 (80 = 64-95) (rh) */
    unsigned int TXR81:1;                   /**< \brief [17:17] Transmission Request 81 (81 = 64-95) (rh) */
    unsigned int TXR82:1;                   /**< \brief [18:18] Transmission Request 82 (82 = 64-95) (rh) */
    unsigned int TXR83:1;                   /**< \brief [19:19] Transmission Request 83 (83 = 64-95) (rh) */
    unsigned int TXR84:1;                   /**< \brief [20:20] Transmission Request 84 (84 = 64-95) (rh) */
    unsigned int TXR85:1;                   /**< \brief [21:21] Transmission Request 85 (85 = 64-95) (rh) */
    unsigned int TXR86:1;                   /**< \brief [22:22] Transmission Request 86 (86 = 64-95) (rh) */
    unsigned int TXR87:1;                   /**< \brief [23:23] Transmission Request 87 (87 = 64-95) (rh) */
    unsigned int TXR88:1;                   /**< \brief [24:24] Transmission Request 88 (88 = 64-95) (rh) */
    unsigned int TXR89:1;                   /**< \brief [25:25] Transmission Request 89 (89 = 64-95) (rh) */
    unsigned int TXR90:1;                   /**< \brief [26:26] Transmission Request 90 (90 = 64-95) (rh) */
    unsigned int TXR91:1;                   /**< \brief [27:27] Transmission Request 91 (91 = 64-95) (rh) */
    unsigned int TXR92:1;                   /**< \brief [28:28] Transmission Request 92 (92 = 64-95) (rh) */
    unsigned int TXR93:1;                   /**< \brief [29:29] Transmission Request 93 (93 = 64-95) (rh) */
    unsigned int TXR94:1;                   /**< \brief [30:30] Transmission Request 94 (94 = 64-95) (rh) */
    unsigned int TXR95:1;                   /**< \brief [31:31] Transmission Request 95 (95 = 64-95) (rh) */
} Ifx_ERAY_TXRQ3_Bits;

