HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxEray_regdef.h
/** \\brief  OCDS Control and Status */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_OCS_Bits B;
} Ifx_ERAY_OCS;

/** \\brief  Offset Correction Value */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_OCV_Bits B;
} Ifx_ERAY_OCV;

/** \\brief  Odd Sync ID Symbol Window */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_OSID_Bits B;
} Ifx_ERAY_OSID;

/** \\brief  OCDS Trigger Set Select */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_OTSS_Bits B;
} Ifx_ERAY_OTSS;

/** \\brief  PRT Configuration Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_PRTC1_Bits B;
} Ifx_ERAY_PRTC1;

/** \\brief  PRT Configuration Register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_PRTC2_Bits B;
} Ifx_ERAY_PRTC2;

/** \\brief  Rate Correction Value */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_RCV_Bits B;
} Ifx_ERAY_RCV;

/** \\brief  Read Data Section */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_RDDS_Bits B;
} Ifx_ERAY_RDDS;

/** \\brief  Read Header Section 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_RDHS1_Bits B;
} Ifx_ERAY_RDHS1;

/** \\brief  Read Header Section 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_RDHS2_Bits B;
} Ifx_ERAY_RDHS2;

/** \\brief  Read Header Section 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_RDHS3_Bits B;
} Ifx_ERAY_RDHS3;

/** \\brief  Slot Counter Value */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_SCV_Bits B;
} Ifx_ERAY_SCV;

/** \\brief  SYNC Frame Status */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_SFS_Bits B;
} Ifx_ERAY_SFS;

/** \\brief  Status Service Request Enable Reset */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_SIER_Bits B;
} Ifx_ERAY_SIER;

/** \\brief  Status Service Request Enable Set */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_SIES_Bits B;
} Ifx_ERAY_SIES;

/** \\brief  Status Service Request Line Select */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_SILS_Bits B;
} Ifx_ERAY_SILS;

/** \\brief  Status Service Request Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_SIR_Bits B;
} Ifx_ERAY_SIR;

/** \\brief  Stop Watch Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_STPW1_Bits B;
} Ifx_ERAY_STPW1;

/** \\brief  Stop Watch Register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_STPW2_Bits B;
} Ifx_ERAY_STPW2;

/** \\brief  SUC Configuration Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_SUCC1_Bits B;
} Ifx_ERAY_SUCC1;

/** \\brief  SUC Configuration Register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_SUCC2_Bits B;
} Ifx_ERAY_SUCC2;

/** \\brief  SUC Configuration Register 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_SUCC3_Bits B;
} Ifx_ERAY_SUCC3;

/** \\brief  Symbol Window and Network Idle Time Status */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_SWNIT_Bits B;
} Ifx_ERAY_SWNIT;

/** \\brief  Timer 0 Configuration */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_T0C_Bits B;
} Ifx_ERAY_T0C;

/** \\brief  Timer 1 Configuration */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_T1C_Bits B;
} Ifx_ERAY_T1C;

/** \\brief  Test Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_TEST1_Bits B;
} Ifx_ERAY_TEST1;

/** \\brief  Test Register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_TEST2_Bits B;
} Ifx_ERAY_TEST2;

/** \\brief  Transmission Request Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_TXRQ1_Bits B;
} Ifx_ERAY_TXRQ1;

